.config/doom/doom-private.org
#+title: DOOM Emacs Configuration
#+author: JJ Kim
#+description: A Doom Emacs Configuration
#+startup: fold
#+property: header-args:emacs-lisp :tangle yes :comments no

* Doom Configuration
** Modules
:PROPERTIES:
:header-args:emacs-lisp: :tangle no
:END:

#+name: init.el
#+attr_html: :collapsed t
#+begin_src emacs-lisp :tangle "init.el" :noweb no-export
;;; init.el -*- lexical-binding: t; -*-

;; This file controls what Doom modules are enabled and what order they load in.
;; Press 'K' on a module to view its documentation, and 'gd' to browse its directory.

(doom! :completion
       <<doom-completion>>

       :ui
       <<doom-ui>>

       :editor
       <<doom-editor>>

       :emacs
       <<doom-emacs>>

       :term
       <<doom-term>>

       :checkers
       <<doom-checkers>>

       :tools
       <<doom-tools>>

       :os
       <<doom-os>>

       :lang
       <<doom-lang>>

       :email
       <<doom-email>>

       :app
       <<doom-app>>

       :config
       <<doom-config>>)

#+end_src

*** app

#+name: doom-app
#+begin_src emacs-lisp

calendar
;;emms
;;everywhere        ; *leave* Emacs!? You must be joking
;;irc               ; how neckbeards socialize
;;(rss +org)        ; emacs as an RSS reader
;;twitter           ; twitter client https://twitter.com/vnought

#+end_src

*** config

#+name: doom-config
#+begin_src emacs-lisp

literate
(default +bindings +smartparens)

#+end_src

*** completion

#+name: doom-completion
#+begin_src emacs-lisp

(company                     ; the ultimate code completion backend
 +childframe)                ; ... when your children are better than you
(vertico +icons)             ; the search engine of the future
;;helm              ; the *other* search engine for love and life
;;ido               ; the other *other* search engine...
;;ivy               ; a search engine for love and life

#+end_src

*** ui

#+name: doom-ui
#+begin_src emacs-lisp

;;deft              ; notational velocity for Emacs
doom              ; what makes DOOM look the way it does
doom-dashboard    ; a nifty splash screen for Emacs
doom-quit         ; DOOM quit-message prompts when you quit Emacs
(emoji +unicode)  ; 🙂
hl-todo           ; highlight TODO/FIXME/NOTE/DEPRECATED/HACK/REVIEW
hydra
indent-guides     ; highlighted indent columns
;;(ligatures +extra); ligatures and symbols to make your code pretty again
minimap           ; show a map of the code on the side
modeline          ; snazzy, Atom-inspired modeline, plus API
nav-flash         ; blink cursor line after big motions
neotree           ; a project drawer, like NERDTree for vim
ophints            ; highlight the region an operation acts on
(popup +defaults)   ; tame sudden yet inevitable temporary windows
;;tabs              ; a tab bar for Emacs
;;treemacs          ; a project drawer, like neotree but cooler
unicode           ; extended unicode support for various languages
vc-gutter         ; vcs diff in the fringe
vi-tilde-fringe   ; fringe tildes to mark beyond EOB
window-select     ; visually switch windows
workspaces        ; tab emulation, persistence & separate workspaces
zen               ; distraction-free coding or writing

#+end_src

*** editor

#+name: doom-editor
#+begin_src emacs-lisp

(evil +everywhere); come to the dark side, we have cookies
file-templates    ; auto-snippets for empty files
fold              ; (nigh) universal code folding
;;(format +onsave)  ; automated prettiness
;;god               ; run Emacs commands without modifier keys
;;lispy             ; vim for lisp, for people who don't like vim
multiple-cursors  ; editing in many places at once
;;objed             ; text object editing for the innocent
;;parinfer          ; turn lisp into python, sort of
;;rotate-text       ; cycle region at point between text candidates
snippets          ; my elves. They type so I don't have to
;;word-wrap         ; soft wrapping with language-aware indent

#+end_src

*** emacs

#+name: doom-emacs
#+begin_src emacs-lisp

(dired +icons)    ; making dired pretty [functional]
electric          ; smarter, keyword-based electric-indent
(ibuffer +icons)  ; interactive buffer management
undo              ; persistent, smarter undo for your inevitable mistakes
vc                ; version-control and Emacs, sitting in a tree

#+end_src

*** term

#+name: doom-term
#+begin_src emacs-lisp

eshell            ; the elisp shell that works everywhere
;;shell             ; simple shell REPL for Emacs
term              ; basic terminal emulator for Emacs
vterm             ; the best terminal emulation in Emacs

#+end_src

*** checkers

#+name: doom-checkers
#+begin_src emacs-lisp

syntax              ; tasing you for every semicolon you forget
(:if (executable-find "aspell") spell) ; tasing you for misspelling mispelling
(:if (executable-find "languagetool") grammar) ; tasing grammar mistake every you make

#+end_src

*** tools

#+name: doom-tools
#+begin_src emacs-lisp

;;ansible
(debugger +lsp)   ; stepping through code, to help you add bugs
direnv
;;docker
editorconfig      ; let someone else argue about tabs vs spaces
;;ein               ; tame Jupyter notebooks with emacs
(eval +overlay)     ; run code, run (also, repls)
;;gist              ; interacting with github gists
(lookup           ; helps you navigate your code and documentation
 +dictionary      ; dictionary/thesaurus is nice
 +docsets)        ; ...or in Dash docsets locally
(lsp +eglot)               ; M-x vscode
magit             ; a git porcelain for Emacs
;;make              ; run make tasks from Emacs
;;pass              ; password manager for nerds
pdf               ; pdf enhancements
;;prodigy           ; managing external services & code builders
rgb               ; creating color strings
;;taskrunner        ; taskrunner for all your projects
;;terraform         ; infrastructure as code
;;tmux              ; an API for interacting with tmux
;;upload            ; map local to remote projects via ssh/ftp
tree-sitter       ; Syntax and Parsing sitting in a tree

#+end_src

*** os

#+name: doom-os
#+begin_src emacs-lisp

(:if IS-MAC macos) ; improve compatibility with macOS

#+end_src

*** lang

#+name: doom-lang
#+begin_src emacs-lisp

(agda +local)          ; types of types of types of types...
;;beancount         ; mind the GAAP
cc                ; C > C++ == 1
;;clojure           ; java with a lisp
common-lisp       ; if you've seen one lisp, you've seen them all
coq               ; proofs-as-programs
;;crystal           ; ruby at the speed of c
(csharp +lsp)      ; unity, .NET, and mono shenanigans
;;data              ; config/data formats
;;(dart +flutter)   ; paint ui and not much else
elixir            ; erlang done right
elm               ; care for a cup of TEA?
emacs-lisp        ; drown in parentheses
erlang            ; an elegant language for a more civilized age
;;ess               ; emacs speaks statistics
;;factor
;;faust             ; dsp, but you get to keep your soul
fsharp            ; ML stands for Microsoft's Language
;;fstar             ; (dependent) types and (monadic) effects and Z3
;;gdscript          ; the language you waited for
(go +lsp)         ; the hipster dialect
;; (haskell +dante)  ; a language that's lazier than I am
(haskell +lsp) ; a language that's lazier than I am
;;hy                ; readability of scheme w/ speed of python
idris             ; a language you can depend on
json              ; At least it ain't XML
;;(java +meghanada) ; the poster child for carpal tunnel syndrome
javascript        ; all(hope(abandon(ye(who(enter(here))))))
julia             ; a better, faster MATLAB
kotlin            ; a better, slicker Java(Script)
(latex            ; writing papers in Emacs has never been so fun
 ;;+fold          ; fold the clutter away nicities
 +latexmk         ; modern latex plz
 ;;+cdlatex       ; quick maths symbols
 +lsp)
;;lean              ; for folks with too much to prove
;;ledger            ; be audit you can be
lua               ; one-based indices? one-based indices
markdown          ; writing docs for people to ignore
;;nim               ; python + lisp at the speed of c
nix               ; I hereby declare "nix geht mehr!"
ocaml             ; an objective camel
(org              ; organize your plain life in plain text
 ;;+pretty        ; yessss my pretties! (nice unicode symbols)
 +dragndrop       ; drag & drop files/images into org buffers
 +hugo          ; use Emacs for hugo blogging
 ;;+noter         ; enhanced PDF notetaking
 +jupyter         ; ipython/jupyter support for babel
 +pandoc          ; export-with-pandoc support
 +gnuplot         ; who doesn't like pretty pictures
 +pomodoro        ; be fruitful with the tomato technique
 +present       ; using org-mode for presentations
 +roam2)          ; wander around notes
;;php               ; perl's insecure younger brother
;;plantuml          ; diagrams for confusing people more
purescript        ; javascript, but functional
(python           ; beautiful is better than ugly
 +lsp
 +pyright
 +tree-sitter
 +cython)
;;qt                ; the 'cutest' gui framework ever
racket            ; a DSL for DSLs
;;raku              ; the artist formerly known as perl6
;;rest              ; Emacs as a REST client
;;rst               ; ReST in peace
(ruby +rails)     ; 1.step {|i| p "Ruby is #{i.even? ? 'love' : 'life'}"}
(rust +lsp +tree-sitter)  ; Fe2O3.unwrap().unwrap().unwrap().unwrap()
;;scala             ; java, but good
(scheme +guile)   ; a fully conniving family of lisps
sh                ; she sells {ba,z,fi}sh shells on the C xor
;;sml
;;solidity          ; do you need a blockchain? No.
;;swift             ; who asked for emoji variables?
;;terra             ; Earth and Moon in alignment for performance.
;;web               ; the tubes
yaml              ; JSON, but readable
;;zig               ; C, but simpler

#+end_src

*** email

#+name: doom-email
#+begin_src emacs-lisp

;;(mu4e +gmail)
;;notmuch
;;(wanderlust +gmail)

#+end_src

** Packages

#+begin_src emacs-lisp :tangle packages.el :comments no
;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el

;; To install a package with Doom you must declare them here and run 'doom sync'
;; on the command line, then restart Emacs for the changes to take effect -- or
;; use 'M-x doom/reload'.


;; To install SOME-PACKAGE from MELPA, ELPA or emacsmirror:
;(package! some-package)

;; To install a package directly from a remote git repo, you must specify a
;; `:recipe'. You'll find documentation on what `:recipe' accepts here:
;; https://github.com/raxod502/straight.el#the-recipe-format
;(package! another-package
;  :recipe (:host github :repo "username/repo"))

;; If the package you are trying to install does not contain a PACKAGENAME.el
;; file, or is located in a subdirectory of the repo, you'll need to specify
;; `:files' in the `:recipe':
;(package! this-package
;  :recipe (:host github :repo "username/repo"
;           :files ("some-file.el" "src/lisp/*.el")))

;; If you'd like to disable a package included with Doom, you can do so here
;; with the `:disable' property:
;(package! builtin-package :disable t)

;; You can override the recipe of a built in package without having to specify
;; all the properties for `:recipe'. These will inherit the rest of its recipe
;; from Doom or MELPA/ELPA/Emacsmirror:
;(package! builtin-package :recipe (:nonrecursive t))
;(package! builtin-package-2 :recipe (:repo "myfork/package"))

;; Specify a `:branch' to install a package from a particular branch or tag.
;; This is required for some packages whose default branch isn't 'master' (which
;; our package manager can't deal with; see raxod502/straight.el#279)
;(package! builtin-package :recipe (:branch "develop"))

;; Use `:pin' to specify a particular commit to install.
;(package! builtin-package :pin "1a2b3c4d5e")


;; Doom's packages are pinned to a specific commit and updated from release to
;; release. The `unpin!' macro allows you to unpin single packages...
;(unpin! pinned-package)
;; ...or multiple packages
;(unpin! pinned-package another-pinned-package)
;; ...Or *all* packages (NOT RECOMMENDED; will likely break things)
;(unpin! t)

#+end_src

* Emacs Configuration
:PROPERTIES:
:header-args:emacs-lisp: :tangle "config.el"
:END:
** Name and Address

#+begin_src emacs-lisp

(setq user-full-name "JJ Kim"
      user-mail-address "jj@haedosa.xyz")

#+end_src
** Hangul

#+begin_src emacs-lisp

(setq default-input-method "korean-hangul3f")

#+end_src

** Backup

#+begin_src emacs-lisp

(setq-default backup-directory-alist '(("" . "~/.backup"))
              make-backup-files t
              vc-make-backup-files t
              backup-by-copying t
              version-control t
              delete-old-versions t
              kept-new-versions 99
              kept-old-versions 0
)

(defun force-backup-of-buffer ()
  (setq buffer-backed-up nil)
  (backup-buffer))
(add-hook 'before-save-hook  'force-backup-of-buffer)

#+end_src

** Visualization
*** theme

#+begin_src emacs-lisp

(setq doom-theme 'doom-one)

#+end_src

*** Font

#+begin_src emacs-lisp

(setq doom-font (font-spec :family "Mononoki Nerd Font" :size 22)
      doom-big-font (font-spec :family "Mononoki Nerd Font" :size 36)
      doom-variable-pitch-font (font-spec :family "Mononoki Nerd Font" :size 22))

#+end_src

*** Display Line Number

#+begin_src emacs-lisp

(setq display-line-numbers-type t)

#+end_src
*** Windsize

#+begin_src emacs-lisp :tangle packages.el

(package! windsize)

#+end_src

#+begin_src emacs-lisp

(use-package! windsize
  :custom
  (windsize-cols 1)
  (windsize-rows 1)
  :commands windsize-left windsize-right
            windsize-up windsize-down
)

(map!
  "C-S-h" #'windsize-left
  "C-S-l" #'windsize-right
  "C-S-k" #'windsize-up
  "C-S-j" #'windsize-down
)

#+end_src

*** Winum

#+begin_src emacs-lisp :tangle packages.el

(package! winum)

#+end_src

#+begin_src emacs-lisp

(use-package! winum
  :config
  (winum-mode 1)
)

#+end_src

*** Transparency

#+begin_src emacs-lisp

(add-to-list 'default-frame-alist '(alpha 97 80))

(defun my/display-transparency (a b)
  (interactive "nAlpha Active:\nnAlpha Inactive:")
  (set-frame-parameter nil 'alpha `(,a . ,b)))

#+end_src
** Programming
*** Envrc

#+begin_src emacs-lisp

(use-package! envrc
  :hook (after-init . envrc-global-mode))

#+end_src

*** lsp
