.config/doom/config.el
(setq user-full-name "replit"
      user-mail-address "replit@haedosa.xyz")

(setq default-input-method "korean-hangul3f")

(setq-default backup-directory-alist '(("" . "~/.backup"))
              make-backup-files t
              vc-make-backup-files t
              backup-by-copying t
              version-control t
              delete-old-versions t
              kept-new-versions 99
              kept-old-versions 0
)

(defun force-backup-of-buffer ()
  (setq buffer-backed-up nil)
  (backup-buffer))
(add-hook 'before-save-hook  'force-backup-of-buffer)

(setq doom-theme 'doom-one)

(setq doom-font (font-spec :family "Mononoki Nerd Font" :size 22)
      doom-big-font (font-spec :family "Mononoki Nerd Font" :size 36)
      doom-variable-pitch-font (font-spec :family "Mononoki Nerd Font" :size 22))

(setq display-line-numbers-type t)

(use-package! windsize
  :custom
  (windsize-cols 1)
  (windsize-rows 1)
  :commands windsize-left windsize-right
            windsize-up windsize-down
)

(map!
  "C-S-h" #'windsize-left
  "C-S-l" #'windsize-right
  "C-S-k" #'windsize-up
  "C-S-j" #'windsize-down
)

(use-package! winum
  :config
  (winum-mode 1)
)

(add-to-list 'default-frame-alist '(alpha 97 80))

(defun my/display-transparency (a b)
  (interactive "nAlpha Active:\nnAlpha Inactive:")
  (set-frame-parameter nil 'alpha `(,a . ,b)))

(use-package! envrc
  :hook (after-init . envrc-global-mode))
