.config/doom/doom-private.org
**** lsp

#+begin_src emacs-lisp

(use-package! lsp-mode
  :custom
  (lsp-completion-enable-additional-text-edit nil)
  (lsp-lens-enable nil)
  (lsp-keymap-prefix "C-c l")
  (lsp-headerline-breadcrumb-enable nil)
  (lsp-ui-sideline-enable nil)
  (lsp-ui-sideline-show-diagnostics nil)
  (lsp-modeline-diagnostics-enable nil)
  ;;(lsp-eldoc-enable-hover nil)
  :config
  (map! "C-,"       #'lsp-execute-code-action)
)


#+end_src

**** lsp-ui

#+begin_src emacs-lisp :tangle packages.el

(package! lsp-ui)

#+end_src

#+begin_src emacs-lisp

(use-package! lsp-ui
  :disabled t)

#+end_src

**** Lsp-ui-doc

#+begin_src emacs-lisp

(after! lsp-ui
  (setq lsp-ui-doc-position 'top)
  (setq lsp-ui-doc-show-with-cursor t)
  (setq lsp-ui-sideline-show-code-actions t))

(defun my/cycle-lsp-ui-doc-position ()
  (interactive)
  (setq lsp-ui-doc-position
     (let ((x lsp-ui-doc-position))
        (cond ((eq x 'top) 'bottom)
              ((eq x 'bottom) 'at-point)
              ((eq x 'at-point) 'top))))
)

(defun set-lsp-ui-doc-size()
  (interactive)
  (setq lsp-ui-doc-text-scale-level 2)
  (setq lsp-ui-doc-max-width 300)
  (setq lsp-ui-doc-max-height 50))

#+end_src

**** lsp-haskell

#+begin_src emacs-lisp :tangle packages.el

(package! lsp-haskell)

#+end_src

#+begin_src emacs-lisp

(use-package! haskell-mode
  :hook ((haskell-mode . lsp-deferred)
         (haskell-mode . (lambda ()
                           (set-tab-width)
                           (turn-off-smartparens-mode)
                           (setq lsp-haskell-formatting-provider "fourmolu")
                           (global-subword-mode)
                           ))))

(add-hook 'lsp-after-open-hook (lambda ()
   (lsp-ui-mode -1)
   ))

#+end_src
**** consult-lsp

#+begin_src emacs-lisp :tangle packages.el

(package! consult-lsp)

#+end_src

**** consult-eglot

#+begin_src emacs-lisp :tangle packages.el

(package! consult-eglot)

#+end_src

**** lsp-mode issue

https://github.com/hlissner/doom-emacs/issues/5904

#+begin_src emacs-lisp

;; add to $DOOMDIR/config.el
(after! lsp-mode
  (advice-remove #'lsp #'+lsp-dont-prompt-to-install-servers-maybe-a))

#+end_src
** Org Mode
*** Org Archive

#+begin_src emacs-lisp

  (defun my/org-archive()
    (setq
      org-archive-mark-done nil
      org-archive-location "%s_arxiv::"
    )
  )

#+end_src

*** Org Capture

#+begin_src emacs-lisp

  (defun my/org-capture()
    (setq org-capture-templates `(
      ("h" "Haedosa" entry
        (file+olp+datetree ,(concat org-directory "/haedosa/README.org"))
        "* %? %U\n%a\n%i"
      )
      ("m" "Memo" entry
        (file+olp+datetree ,(concat org-directory "/memo/memo.org"))
        "* %? %U\n%a\n%i"
      )
      ("s" "Self" entry
        (file+olp+datetree ,(function buffer-file-name))
        "* %? %U\n%a\n%i"
      )
  )))

#+end_src

*** Org Agenda

#+begin_src emacs-lisp

  (defun my/org-agenda()
    (setq org-agenda-files
       (list
          (concat org-directory "/haedosa/README.org")
          (concat org-directory "/memo/memo.org")
       )
    )

    (setq org-agenda-ndays 7
          org-agenda-show-all-dates t)
  )

#+end_src

*** Org Babel

#+begin_src emacs-lisp

  (defun my/org-babel()

    (org-babel-do-load-languages
      'org-babel-load-languages
      '((haskell . t)
        (emacs-lisp . t)
        (shell . t)
        (sql . t)
        (ruby . t)
        (python . t)
        (maxima . t)
        (C . t)
        (R . t)
        (latex . t)
        (ditaa . t)
        (java . t))
    )

    (setq org-catch-invisible-edits           'show
          org-src-preserve-indentation        t
          org-src-tab-acts-natively           t
          org-fontify-quote-and-verse-blocks  t
          org-return-follows-link             t
          org-edit-src-content-indentation    0
          org-src-fontify-natively            t
          org-confirm-babel-evaluate          nil
    )
  )

#+end_src

*** Org id

=org-id-new= creates an uuid (e.g. A11DC7CB-D0ED-4C63-9941-8E692945823A), which
is served as org-attach path. What bugged me for while is that the uuid is in
the downcase on linux (e.g. a11dc7cb-d0ed-4c63-9941-8e692945823a) while it is in
the upcase on mac (e.g. A11DC7CB-D0ED-4C63-9941-8E692945823A). This discrepancy
causes conflict in syncing files between linux and mac.

#+begin_src emacs-lisp

  (defun my/org-id()
    (advice-add 'org-id-new :filter-return #'upcase)
  )

#+end_src

*** Org Format Style

#+begin_src emacs-lisp

(defun my/org-header-size()
  (dolist (face '((org-level-1 . 1.3)
                  (org-level-2 . 1.2)
                  (org-level-3 . 1.1)
                  (org-level-4 . 1.1)
                  (org-level-5 . 1.1)
                  (org-level-6 . 1.0)
                  (org-level-7 . 1.0)
                  (org-level-8 . 1.0)))
    (set-face-attribute (car face) nil :height (cdr face)))

    (setq org-format-latex-options
      '(:foreground default :background default :scale 4
        :html-foreground "Black" :html-background "Transparent" :html-scale 1.0
        :matchers ("begin" "$1" "$" "$$" "\\(" "\\[")))
)

#+end_src
*** Org

#+begin_src emacs-lisp

(use-package! org
  :custom
  (org-directory                       "~/Ocean/Org")
  (org-ellipsis                        " ▾")
  (org-src-fontify-natively            t)
  (org-src-tab-acts-natively           t)
  (org-hide-block-startup              nil)
  (org-src-preserve-indentation        t)
  (org-startup-folded                  'content)
  (org-startup-indented                t)
  (org-startup-with-inline-images      nil)
  (org-hide-leading-stars              t)
  (org-attach-id-dir                   "data/")
  (org-export-with-sub-superscripts (quote {}))
  :config
  (my/org-archive)
  (my/org-capture)
  (my/org-agenda)
  (my/org-babel)
  (my/org-id)
  (my/org-header-size)
)

#+end_src

*** Swagger to Org


#+begin_src emacs-lisp :tangle packages.el

(package! swagger-to-org)

#+end_src

#+begin_src emacs-lisp

(use-package! swagger-to-org)

#+end_src

*** Org Roam

#+begin_src emacs-lisp :tangle packages.el

(package! org-roam)

#+end_src

#+begin_src emacs-lisp

(defun my/org-roam-directory ()
  (let ((org-roam-directory (expand-file-name "Dropbox/roam" (getenv "HOME"))))
    (unless (file-exists-p org-roam-directory)
      (make-directory org-roam-directory t))
    org-roam-directory))

(use-package! org-roam
  :ensure t
  :custom
  (org-roam-directory (my/org-roam-directory))
  (org-roam-completion-everywhere t)
  :bind (("C-c n b" . org-roam-buffer-toggle)
         ("C-c n f" . org-roam-node-find)
         ;;("C-c n g" . org-roam-graph)
         ("C-c n i" . org-roam-node-insert)
         ("C-c n a" . org-roam-alias-add)
         ("C-c n u" . org-roam-ui-open)
         ("C-c n g" . org-id-get-create)
         ("C-c n t" . org-roam-tag-add)
         :map org-mode-map
         ("C-c n c" . org-roam-capture)
         ;; Dailies
         ("C-c n j" . org-roam-dailies-capture-today))
  :config
  ;; If you're using a vertical completion framework, you might want a more informative completion interface
    (setq org-roam-node-display-template (concat "${title:*} " (propertize "${tags:10}" 'face 'org-tag)))
    (org-roam-db-autosync-mode)
;;   ;; If using org-roam-protocol
   (require 'org-roam-protocol))

#+end_src

*** Org Roam UI

#+begin_src emacs-lisp :tangle packages.el

;; (unpin! org-roam)
(package! org-roam-ui)

#+end_src

#+begin_src emacs-lisp


(use-package! websocket
    :after org-roam)

(use-package! org-roam-ui
    :after org-roam ;; or :after org
;;         normally we'd recommend hooking orui after org-roam, but since org-roam does not have
;;         a hookable mode anymore, you're advised to pick something yourself
;;         if you don't care about startup time, use
;;  :hook (after-init . org-roam-ui-mode)
    :config
    (setq org-roam-ui-sync-theme t
          org-roam-ui-follow t
          org-roam-ui-update-on-save t
          org-roam-ui-open-on-start t))

#+end_src

** Editing
*** Evil
**** Evil-shift-width

#+begin_src emacs-lisp

(setq-default tab-width 2)
(setq-default evil-shift-width tab-width)
(setq-default indent-tabs-mode nil)

(defun set-tab-width()
  (interactive)
  (setq tab-width 2)
  (setq evil-shift-width tab-width)
  (setq indent-tabs-mode nil))


#+end_src

**** Evil-Snipe

#+begin_src emacs-lisp

(setq-default evil-snipe-scope 'buffer)

#+end_src

*** Company

#+begin_src emacs-lisp

(use-package! company
  ;; :config (company-box-mode)
  :custom (company-idle-delay nil))

(map! :map company-active-map
  "TAB"        #'company-complete-common-or-cycle
  "<tab>"      #'company-complete-common-or-cycle
  "C-SPC"      #'company-complete
  "<C-space>"  #'company-complete
)

#+end_src

