.config/doom/config.el

(use-package! company-math
  :config
  (defun my/latex-mode-setup ()
    (interactive)
    (setq-local company-backends
                (append '((company-math-symbols-latex company-latex-commands))
                        company-backends)))
  )

(map! :map global-map "C-M-i"   #'completion-at-point)

(use-package! whitespace
  :custom (whitespace-style '(face tabs trailing
                              space-before-tab
                              newline empty
                              space-after-tab))
  :hook (((prog-mode org-mode) . whitespace-mode)
         (before-save . delete-trailing-whitespace))
)

(use-package! string-inflection)

(mapc (lambda (x) (add-to-list '+lookup-provider-url-alist x))
      (list
        '("Hackage"           "http://hackage.haskell.org/package/%s")
        '("Hoogle"            "http://www.haskell.org/hoogle/?q=%s")
        '("Haedosa Gitlab"    "https://gitlab.com/search?group_id=12624055&search=%s")
        '("Dictionary"        "http://dictionary.reference.com/browse/%s")
        '("Thesaurus"         "http://thesaurus.reference.com/search?q=%s")
        '("Google Scholar"    "https://scholar.google.com/scholar?q=%s")
        '("Nix Packages"      "https://search.nixos.org/packages?channel=unstable&query=%s")
        '("Nix Options"       "https://search.nixos.org/options?channel=unstable&query=%s")
        '("Libgen"            "http://libgen.rs/search.php?req=%s")))

(use-package! rg
  :commands (rg rg-menu)
  :bind ("C-c s" . rg-menu)
  :config
  (message "rg loaded")
)

(map! :leader
      (:prefix-map ("a" . "avy")
        :desc "avy-goto-char-2" "2" #'avy-goto-char-2
        :desc "avy-goto-char-timer" "a" #'avy-goto-char-timer
        :desc "avy-goto-line" "l" #'avy-goto-line
        :desc "avy-goto-word-0" "w" #'avy-goto-word-0
        :desc "avy-goto-subword-0" "s" #'avy-goto-subword-0
        :desc "avy-resume" "r" #'avy-resume
        :desc "avy-transpose-lines-in-region" "t" #'avy-transpose-lines-in-region
        (:prefix ("c" . "copy")
           :desc "avy-copy-region" "r" #'avy-copy-region
           :desc "avy-copy-line" "l" #'avy-copy-line)
        (:prefix ("m" . "move")
           :desc "avy-move-region" "r" #'avy-move-region
           :desc "avy-move-line" "l" #'avy-move-line)
      ))

(map! :leader
      (:prefix ("z" . "zoxide/fzf")
        :desc "fzf-directory"     "d" #'fzf-directory
        :desc "fzf-grep"          "g" #'fzf-grep
        :desc "fzf-git-grep"      "G" #'fzf-git-grep
        :desc "fzf-switch-buffer" "b" #'fzf-switch-buffer)
      ">" #'fzf-directory)

  (map! :leader
        (:prefix ("z" . "zoxide/fzf")
          :desc "zoxide-add"                    "a" #'zoxide-add
          :desc "zoxide-cd"                     "c" #'zoxide-cd
          :desc "zoxide-find-file"              "f" #'zoxide-find-file
          :desc "zoxide-travel"                 "t" #'zoxide-travel
          :desc "zoxide-remove"                 "x" #'zoxide-remove
          :desc "zoxide-add-with-query"         "A" #'zoxide-add-with-query
          :desc "zoxide-cd-with-query"          "C" #'zoxide-cd-with-query
          :desc "zoxide-find-file-with-query"   "F" #'zoxide-find-file-with-query
          :desc "zoxide-travel-with-query"      "T" #'zoxide-travel-with-query
        ))

(map! :leader "d" #'dired-jump)

(use-package! dired-hide-dotfiles
  :after dired
  :hook (dired-mode . dired-hide-dotfiles-mode)
  :config
    (map! (:map dired-mode-map
           :n "H" #'dired-hide-dotfiles-mode)))

(use-package! dired-ranger
  :after dired
  :bind (:map dired-mode-map
          ("C-c C-b" . dired-ranger-bookmark)
          ("C-c C-v" . dired-ranger-bookmark-visit)
          ("C-c C-p" . dired-ranger-paste)
          ("C-c C-y" . dired-ranger-copy)
          ("C-c C-x" . dired-ranger-move))
)

(use-package! all-the-icons-dired
  :after all-the-icons dired
  :hook (dired-mode . all-the-icons-dired-mode))

(setq which-key-idle-delay 0.1)

(use-package! vterm
  :bind
    ("C-c C-j" . vterm-send-C-j)
    ("C-c C-k" . vterm-send-C-k)
  :config
    (map! :after vterm
          :map vterm-mode-map
          :ni "C-j"    #'vterm-send-down
          :ni "C-k"    #'vterm-send-up
          :ni "<down>" #'vterm-send-down
          :ni "<up>"   #'vterm-send-up
          :ni "C-r"    #'vterm-send-C-r
          :ni "C-t"    #'vterm-send-C-t
          )   )

(use-package! vterm
  :config
    (defun get-full-list ()
      (let ((program-list (split-string (shell-command-to-string "compgen -c") "\n" t ))
            (file-directory-list (split-string (shell-command-to-string "compgen -f") "\n" t ))
            (history-list (with-temp-buffer
                            (insert-file-contents "~/.bash_history")
                            (split-string (buffer-string) "\n" t))))

        (delete-dups (append program-list file-directory-list history-list))))

    (defun vterm-completion-choose-item ()
      (completing-read "Choose: " (get-full-list) nil nil (thing-at-point 'word 'no-properties)))

    (defun vterm-completion ()
      (interactive)
      (vterm-directory-sync)
      (let ((vterm-chosen-item (vterm-completion-choose-item)))
        (when (thing-at-point 'word)
          (vterm-send-meta-backspace))
        (vterm-send-string vterm-chosen-item)))

    (defun vterm-directory-sync ()
      "Synchronize current working directory."
      (interactive)
      (when vterm--process
        (let* ((pid (process-id vterm--process))
               (dir (file-truename (format "/proc/%d/cwd/" pid))))
              (setq default-directory dir))))

    (map! :after vterm
          :map vterm-mode-map
          :ni "C-TAB"      #'vterm-completion
          :ni "C-<tab>"    #'vterm-completion
          :ni "C-RET"      #'vterm-directory-sync
          :ni "C-<return>" #'vterm-directory-sync))

  (defun get-current-workspace-name()
    (safe-persp-name (get-current-persp)))

  (map! :map (global-map vterm-mode-map org-mode-map)
        "M-["     #'+workspace/switch-left
        "M-]"     #'+workspace/switch-right
        "M-{"     #'+workspace/swap-left
        "M-}"     #'+workspace/swap-right
        "M-`"     #'+workspace/other
        "M-,"     #'+workspace/switch-to
        "M-TAB"   #'+workspace/switch-to
        "M-<tab>" #'+workspace/switch-to)

  (map! "C-{"      #'previous-buffer
        "C-}"      #'next-buffer)

  (map! :leader
        :desc "previous-buffer" "[" #'previous-buffer
        :desc "next-buffer"     "]" #'next-buffer)

  (map! :map (global-map org-mode-map)
        "C-j"  #'forward-paragraph
        "C-K"  #'backward-paragraph)

  (map! :map minibuffer-mode-map
        "M-j"  #'next-history-element
        "M-k"  #'previous-history-element)

  (map! :leader "r" #'consult-ripgrep)
